In [1]:
import pandas as pd
from pandas import Series,DataFrame
import numpy as np

In [2]:
from io import StringIO

In [5]:
data="""
Sample Animal Intelligence
1 Dog Smart
2 Dog Smart
3 Cat Dumb
4 Cat Dumb
5 Dog Dumb
6 Cat Smart"""

In [6]:
#delim_whitespace : boolean, default False Specifies whether or not whitespace (e.g. ' ' or '    ') 
#will be used as the sep. Equivalent to setting sep='\s+'. If this option is set to True, nothing 
#should be passed in for the delimiter parameter.

dframe=pd.read_table(StringIO(data),sep='\s+')
dframe

   Sample Animal Intelligence
0       1    Dog        Smart
1       2    Dog        Smart
2       3    Cat         Dumb
3       4    Cat         Dumb
4       5    Dog         Dumb
5       6    Cat        Smart

In [7]:
#?pd.crosstab

In [8]:
pd.crosstab(dframe.Animal,dframe.Intelligence)

Intelligence  Dumb  Smart
Animal
Cat              2      1
Dog              1      2

In [9]:
pd.crosstab(dframe.Animal,dframe.Intelligence)

Intelligence  Dumb  Smart
Animal
Cat              2      1
Dog              1      2

In [11]:
?pd.crosstab

In [10]:
pd.crosstab(dframe.Animal,dframe.Intelligence,margins=True)# adds total value

Intelligence  Dumb  Smart  All
Animal
Cat              2      1    3
Dog              1      2    3
All              3      3    6

In [12]:
pd.crosstab(dframe.Animal,dframe.Intelligence,margins=True, normalize= 'index')# adds total value

Intelligence      Dumb     Smart
Animal
Cat           0.666667  0.333333
Dog           0.333333  0.666667
All           0.500000  0.500000